//// iostream - бібілотека для вводу/виводу на консоль C++
//#include "iostream" // Підключаєм стандартну бібліотеку
////Для роботи проекту Вам потрібно зробити головну функцію
////Головна фукнція - це точка початку роботи програми
////main() - службове слова - для головної фукнції
//void main() // void - стандартне слова - по повертає значення
//{ //Початок блоук коду - main()
//  //std - стандатний простір імен
//  //cout - Console output - вивід на консоль
//  //<< - оператор виводу на консоль
//  // ; - кінець команди
//	std::cout << "Hello my Friends!";
//} //Кінець блоку коду - main()


//#include "iostream"
////int - це ціле число, яке повертає фукнція main
////Це потрібно, щоб при звершені роботи програми, ОС - знав, як вона завешиша роботу
//int main()
//{
//	using namespace std; //Це для того, щоб не писати слова std::
//	cout << "What's up, Doc!\n"; // \n - перехід на новий рядок
//	return 0; //int main() - тому пишу return 0;
//}


//#include<iostream>
//#include<Windows.h>
//void main()
//{
//	using namespace std;
//	//кодування консолі на вивід 65001
//	SetConsoleOutputCP(65001);
//	SetConsoleCP(65001);//Консоль для вводу даних 65001
//	cout << "Привіт кондування консолі\n";
//} //

