#include<iostream>
#include<Windows.h>
using namespace std;

class A
{
public:
    A()
    {
        cout << "Працює конструктор класу A\n";
    }

    // Деструктор класу, як буде працювати

    ~A()
    {
        cout << "---Знищення класу A---\n";
    }
};

class B
{
public:
    B()
    {
        cout << "Працює конструктор класу B\n";
    }
    ~B()
    {
        cout << "---Знищили клас B---\n";
    }
};
//Робимо множинне наслідування і показуємо, як воно спрацьовує
class C : public B, public A
{
public:
    C()
    {
        cout << "Працює конструктор класу С\n";
    }
    ~C()
    {
        cout << "---Знищення класа С---\n";
    }
};

int main()
{
    SetConsoleOutputCP(65001);
    SetConsoleCP(65001);

    cout << "Множине наслідування класів :)\n";

    ////A a; // Автоматично викликається конструктор
    ////B b;
    ////C c;
    //cout << "Працює функція main()\n";
    //if (1 == 1)
    //{
    //    A ananas; // виділяємо память під дану змінну
    //    // У кінці блоку if - потреба у ананас зникає, бо закінчується блок
    //    // має автоматично викликатися декструктор клас
    //}
    //cout << "Завершує роботу функція main()\n";

    C calc;

    return 0;
}