#include<iostream>
#include<Windows.h>
using namespace std;

int main()
{
	SetConsoleOutputCP(65001);
	SetConsoleCP(65001);

	cout << "---Робота з вказівниками---" << endl;

	// Кожна змінна зберігається у пам'яті і відповідає
	// певній адресі у пам'яті де вона знаходиться
	int a = 10; // Звичайна змігга зберігає згачення 10

	cout << "Адреса змінної а: " << &a << endl;
	// Через & отримуємо адресу змінної а
	// Адреса в пам'яті записується в 16-ковій системі
	// числення, яка використовується для позначення 
	// місця розташування даних
	// Десяткова система числення - 0, 1, 2, 3, 4, 5, 6, 7, 8, 9
	// Шістнадцяткова система числення
	// - 0, 1, 2, 4, 5, 6, 7, 8, 9, A, B, C, D, E, F
	// у C++ є вказівники - що вказують на певну адресу пам'яті
	// де зберігається певне значення.
	// Вказівники призначенні для динамічного 
	// виділення пам'яті, динамічне виділення 
	// пам'яті - це програма виділення пам'яті 
	// під час виконання програми

	int* refA; // вказівник на ціле число - зараз він пустий
	refA = &a; // refA тепер зберігає адресу змінної
	// Вказівник зберігає адресу змінної (її шлях), а не саму змінну

	cout << "refA = " << refA << endl; // виводіть адресу, яку зберігає refA
	// Розмінування вказівників:
	// За допомогою оператора * можна отримати значення,
	// яке зберігається за адресою, на яку вказує вказівник
	cout << "Розменування вказівника refA = " << *refA << endl;
	// Змінюємо значення за адресую, на яку вказує refA;
	*refA = 20;
	cout << "Змінна а після зміни через вказівника refA = " << a << endl;

	// Вказівник може бути констатою
	// Констатнта - це змінна, значення якої не можна міняти
	const int* constRefA = &a; // constRefA - константний вказівник на ціле число
    //*constRefA = 30; // Помилка! Не можна змінювати значення через константний вказівник

	return 0;
}