#include<iostream>
#include<Windows.h>
using namespace std;

int main()
{
	SetConsoleOutputCP(65001);
	SetConsoleCP(65001);

	cout << "---Будемо виділять пам'ять---";

	int* ptr = new int; // виділяю пам'ять для одного цілого числа,
	//вказівник буде вказувати на дану область пам'яті

	cout << "Ось адреса пам'яті куди вказує вказівник: "
		<< ptr << endl;
	// якщо пам'ять виділяється, то її потрібно звільняти.
	// Якщо ми її не звільнемо, то залишеться сміття в пам'яті,
	// яке не використовується, але не може бути використано для
	// інших вказіаників

	*ptr = 42;

	delete ptr; // звільняємо пам'ять, на яку вказкє ptr

	cout << "Зробили delete ptr = " << ptr << endl;
	cout << "Зробили delete *ptr = " << *ptr << endl;

	return 0;
}