#include<iostream>
#include<Windows.h>
using namespace std;

int main() {
    SetConsoleOutputCP(65001);
	SetConsoleCP(65001);
    
    //int b = 5; // створили змінну та надали їй значення, комп.тер на автоматі сам виділя пам'ять для комірки де буде лежати значення цієї змінної
    //// припустимо що комірка в якій зберігається значення b має номер 420, тепер кожен раз коли програмі потрібно буде використати зімінну та дізнатися її значення, вона 
    //// буде шукати його в комірці під номером 420

    //// для того щоб дізнатися яку адресу має комірка нашої змінної використовують оператор &

    //cout << b << '\n'; // виводемо змінну b
    //cout << &b << '\n'; // виводему адресу в пам'яті яка веде до комірки 420, в якій зберігається значення змінної b
    //// для того щоб отримати значення по адресі використовують оператор *
    //cout << *&b << '\n'; // виводимо значення b на екран за допомогою адреси та її розмінування

    //// вказівник це змінна, значення якої є адреса в пам'яті
    //int *ptr = &b; // надали значення вказівнику, а саме адресу змінної b
    //cout << ptr << '\n'; 
    //// якщо розмінувати вказфвник то він виведе занчення комірки пам'яті на яку він вказує
    //cout << *ptr << '\n';
    //// ми можемо змінувати значення зміної через її вказівник
    //*ptr = 7; // тепер b тоже дорівнює 7 
    //cout << b << '\n';







    int a = 42;
    cout << &a << '\n';
    cout << *&a << '\n';

    int* lgbt = &a;
    cout << lgbt << '\n';
    cout << *lgbt << '\n';





























    return 0;
}