#include<iostream>
#include<Windows.h>
using namespace std;

int main()
{
	SetConsoleCP(65001);
	SetConsoleOutputCP(65001);
	cout << "---Динамічне виділення пам'яті---\n";

	// є потреба у користувача запросити певну кількість чисел
	// Кількість чисел - наприклад - вік паціентів у лікарні
	cout << "Скільки у вас сьогодні було паціентів: ";
	int n;
	cin >> n;
	// як динамічно виділити пам'ять для масиув з n елементів?
	// якщо я буду вводити інформацію про 5 чи 7 паціентів,
	// і якщо я буду вводити 1000 паціентів,
	// то пам'ять буде використовуватися не ефективно
	// це буде 4*1000 байт, а нам потрібно 4*n байт
	
	//int storage[1000]; // максимум - 1000

	// динамічно виділяжмо потрібну кількість комірок пам'яті для зберегання інформації
	int* storage = new int[n]; // динамічне виділення пам'яті для масиву з n елементів
	// він вказує на першу комірку пам'яті
	cout << "storage = " << storage << endl;
	for (int i = 0; i < n; i++)
	{
		cout << "Вкажіть вік паціента " << i + 1 << ": ";
		//У комірку під номером і щапишемо вік паціента
		cin >> storage[i]; // хаповняємо масив даними про пацієнтів
	}

	for (int i = 0; i < n; i++)
	{
		cout << storage[i] << "\t";
	}
	cout << endl;

	delete[] storage; // звільняємо пам'ять, яку ми виділили для масиву

	storage = NULL; // старий спосіб задати пусте значення для вказівника
	//storage = nullptr // новий спосіб задати пусте значення для вказівника

	return 0;
}