#include<iostream>
#include<Windows.h>

int main()
{
	using namespace std;
	SetConsoleOutputCP(65001);
	SetConsoleCP(65001);


	cout << "Привіт, команда!"<<endl;

	// для роботи з циклом for є спеціальний синтексис його запису
	//int i = 0;
	//i = i + 1; // так писати не зручно
	//i++; // це аналогично як i = i + 1; - оператор інкреиенту
	//i = i - 1; // зменшення на 1
	//i--; // аналогічно, що i = i - 1

	// Що робить цикл - повтор декілька разів одну й туже операцію
	// кількість повторів, може визначати якась змінна n
	// for(ініціалізація_змінних_циклу;умова_продовження_циклу;лічильник_циклу)
	// { -- початок тіла циклу
	// .. тіло циклу - блок в циклі
	// } -- кінецб тіла циклу
	// ініціалізація_змінних_циклу - виконується 1 раз під час початку циклу
	// умова_продовження_циклу - перевіряється на кожній інтерації циклу
	// лічильник_циклу - виконується уожен раз після тіла циклу
	// зробимо цикл який виводіть числа від 1 до 10
	int n = 10; // визначає кількість інтерації циклу
	for (int i = 1;i<=10;i++) // цикл де пропущені усі блоки for (;;) - вічнй цикл
	{
		cout << i << '\t'; // беремо в '' - якщо це 1 символ - "" - якщо більше 2 символів
	}
	cout << "\n";

	// Зроблю програму, у якій користувач вводить діапазон
	int begin, end;
	cout << "Вкажіть діапазон початок\n";
	cin >> begin;
	cout << "Кінець діапазону\n";
	cin >> end;
	for (int i = begin; i <= end; i++)
	{
		if (i % 2 == 0)
			cout << i << "\t";
	}
	cout << "\nДякуєм";

	return 0;
}