#include<iostream>
#include<Windows.h>

int main()
{
	using namespace std;
	SetConsoleOutputCP(65001);
	SetConsoleCP(65001);

	cout << "---Робота з циклом while---\n";
	// Цикл while працює так само як у Пайтон
	// Тобто синтаксис циклу while(умова_циклу)
	// { -- початок тіла циклу
	// .. -- код у тілі циклу - що робить цикл
	// } -- кінець тіла циклу

	// Зробимо найпростіший цикл і проводимо аналогію із for
	// Ініціалізація змінних циклу
	int i = 10; // Будемо виводити числа від 10 до 1
	while (i != 0) // Умова продовження циклу, поки не досягнемо 0
	{
		cout << "i = " << i << "\n";
		i--; // Змінює лічильник циклу на 1
	}

	return 0;
}